04 - Projeto_Time_to_Answer/time_to_answer/lib/tasks/dev.rake

  task add_default_admin: :environment do
    Admin.create!(
      email: 'admin@admin.com',
      password: DEFAULT_PASS,
      password_confirmation: DEFAULT_PASS
    )
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_extra_admins: :environment do
    10.times do |i|
      Admin.create!(
        email: Faker::Internet.email,
        password: DEFAULT_PASS,
        password_confirmation: DEFAULT_PASS
      )
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_default_user: :environment do
    User.create!(
      email: 'user@user.com',
      password: DEFAULT_PASS,
      password_confirmation: DEFAULT_PASS
    )
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_subjects: :environment do
    file_name = 'subjects.txt'
    file_path = File.join(DEFAULT_FILES_PATH, file_name)

    File.open(file_path, 'r').each do |line|
      Subject.create!(description: line.strip)
---
INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Programação"], ["created_at", "2023-03-08 19:32:09.069931"], ["updated_at", "2023-03-08 19:32:09.069931"]]

  task add_answers_and_questions: :environment do
      Subject.all.each do |sub|
        rand(5..10).times.each do |i|
          Question.create!(
            description: "#{Faker::Lorem.paragraph} #{Faker::Lorem.question}",
            subject: sub
          )
---
SELECT "subjects".* FROM "subjects"
INSERT INTO "questions" ("description", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "\#{Faker::Lorem.paragraphs} \#{Faker::Lorem.question}"], ["subject_id", 1], ["created_at", "2023-03-08 19:29:10.747430"], ["updated_at", "2023-03-08 19:29:10.747430"]]