02 - Projeto_Crypto_Wallet/crypto_project/app/controllers/coins_controller.rb

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "updated_at" = ?, "mining_type_id" = ? WHERE "coins"."id" = ?  [["updated_at", "2023-02-08 02:26:33.197722"], ["mining_type_id", 2], ["id", 1]]