04 - Projeto_Time_to_Answer/time_to_answer/app/controllers/admins_backoffice/admins_controller.rb

SELECT "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"
---
  def index
     @admins = Admin.all.page(params[:page])

UPDATE "admins" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "tu@bednar.net"], ["encrypted_password", "$2a$12$Cjjf8zvz9i2QzCa4a30pmegbKT1WG36suA/PZcur7W1237CsmSch2"], ["updated_at", "2023-03-07 20:43:27.150127"], ["id", 2]]
---
  def update
    if @admin.update(params_admin)

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)
    if @admin.save()

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def search_admin
    @admin = Admin.find(params[:format])

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def search_admin_update
    @admin = Admin.find(params[:admin][:id])