04 - Projeto_Time_to_Answer/time_to_answer/app/controllers/admins_backoffice/subjects_controller.rb

  def show
    @subjects = Subject.all.order(:description).page(params[:page])
---
SELECT "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subjects"

  def update
    if @subject.update(params_subject)
---
UPDATE "subjects" SET "description" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["description", "Programação Ruby"], ["updated_at", "2023-03-08 18:59:47.931157"], ["id", 1]]

  def create
    @subject = Subject.new(params_subject)
    if @subject.save()
---
INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "UML"], ["created_at", "2023-03-08 19:00:29.581560"], ["updated_at", "2023-03-08 19:00:29.581560"]]

  def search_subject
    @subject = Subject.find(params[:format])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def search_subject_update
    @subject = Subject.find(params[:subject][:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]