02 - Projeto_Crypto_Wallet/crypto_project/app/views/coins/_form.html.erb

    <%= form.label :mining_type_id %>
  <!-- View acessando diretamente a model! Não pode! <%= form.select("mining_type_id", MiningType.all.collect { |m| [m.description, m.id]}, {include_blank: 'Selecione'}) %> -->
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"