02 - Projeto_Crypto_Wallet/crypto_project/lib/tasks/dev.rake

SELECT "mining_types".* FROM "mining_types"
SELECT "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do

    coins = [
      { description: "Homes",
        acronym: "hm",
        url_image: "https://upload.wikimedia.org/wikipedia/pt/0/02/Homer_Simpson_2006.png",
        mining_type: MiningType.find_by(acronym: "PoW")
      },
      {
        description: "Pudim",
        acronym: "Puds",
        url_image: "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg1CJV5Xfhg2bT2nlEsGgGr26ffkl3lMdus7wIo3lbwXl6QZ2MkCRhbex3bO2mqfyHEtO9i9QtLCGDusXSPqxvDS6lGs8Cjeru0Sj5C_p0RIs7q6K9USDBPftqxOkBKMpMawKDP7ar6qkZ8OWWdZ0ksZy_4Przy9dPAZXlBddqr6Fc9xkwGJ55ZYfhY/s1024/Sonic%20imagem%20png.png",
        mining_type: MiningType.all.sample
      },
      {
        description: "Brunis",
        acronym: "Bru",
        url_image: "https://i.pinimg.com/originals/60/cd/ff/60cdff33a7c7d255fb8ec3c153f4ccd8.png",
        mining_type: MiningType.find_by(acronym: "PoW")
      },
      {
        description: "Naza",
        acronym: "Nazs",
        url_image: "data:image/jpeg;base64,/9j/4AAQSkZJRgABAQAAAQABAAD/2wCEAAkGBxMTEhUTExIWFhUXGCEbGBgYGSEgHRogHx4ZIR8gGyIdHyggHSAlHRofITEiJikrLy4uGh8zODMtNygtLisBCgoKDg0OGxAQGy8mICYvMC0vNS0vLS0vMC8vLS0vLS0vNy8tLS0tLy8tLy0tLS0tLS8tLS0tLS0tLS0vLS0tLf/AABEIAOEA4QMBIgACEQEDEQH/xAAcAAEAAgMBAQEAAAAAAAAAAAAABQYDBAcCAQj/xABDEAABAwIEBAQEBAQEBAUFAAABAgMRAAQFEiExBhNBUSJhcYEHFDKRI1KhsUJiwdFyguHwFSQzohZDktLxCGOys8L/xAAaAQEAAwEBAQAAAAAAAAAAAAAAAgMEAQUG/8QANhEAAQMCBAMHAwMEAgMAAAAAAQACEQMhEjFBUQRhcRMigZGhwfAFsdEjMuEUQlLxYoIzcqL/2gAMAwEAAhEDEQA/AO40pSiJSlKIlKUoiUpSiJSlKIlKUoiUqE4hxN1kJ5SEKJ1JWqAB7Akk1gwLiVLxDbiOU6RIEylY7oPX03qONs4ZupYXYcUW30VipXwmK+1JRSlKURKUpREpSlESlKURKUpREpSlESlKURKUpREpSlESlKURKUrXubttsS4tKf8AEQKItilVu/4ytkaNqLy/ytifudhVducfurhKyFBltJhQb1X6FR0HtNV1KzKf7jHzzVtKhUq/sE/bzyVuxXiO3YOVbkr6ISMyvsKiXOMyRLdm8rzXCB/3RVXwBYXzUjKghWXRUlWgMqJ1O/WsjTiWV8vPzMysqUpAOU+IqO+o036RWF/1EaDz/H8r0m/Sos91xoB7n8L7xPjlwtkrLYC9OW2jxEATJUR1k9O1Vfh3iVTwLLra8yT0BlBGxB3SRVmvcUaA+lasu5CdB9p/WoXEcSt2GkXCDq8SpRV9RO3sNIHkK851Y1HmoM7QRPlzXsUKDWUhQLbGc/PPRatzxq0pXLdeefCTASVFIB7kpgkj7Vb8Gx+5aSCgF9o7IcUAtPorYj119ar1rgzDrSbh+0SM3iMJE66pKiIOu/uKXeJOtIPLbKkjYNwSPbc+1Wnj3sOZJ1BiPZZz9NovaQ1oA3BP8q82nFa0KJu0obbV9JRKsh7LMRr3GlbiuN7Ef+eD3IBIHrppXD7vj9aSpIJB2g7j+oq58McVt/L5n82YmEkyCSQRp+Yf2rZ/W1GAGpTj5tCwv+lNdPYvnKwufZdQwnGGrlJU0qQDBkQfsaka5SvES3lfK4V9LTgkgbmFDNCuvT3q0YXj7yAF3S2iyrZxMgpJ2zg6AHaQd61UeKp1bZHZYeJ4KpQMm43+ZK3UrQZxi3VGV9szt4hrW/WhZEpSlESlKURKUpREpSlESlKURKUpREpSqZ8QHMqAtTq0oSPoQYk6ySRrppp61XVqNpsL3ZBWUqTqrwxmZVueeSgEqUEgdSYqgYy9bOr5ymy6VzBV9ISJAidAIGbQSZqoOYg2u2NwM6wFEJ5iioHLv4SY301rXueLot2nlnM6pBSAlMRJIAjuRG1YOI4suAbTBzH5jNexwf00sdjqxAn/AHOilMP4kb5vJSWgXFZUIy6JEfV7VJfJojVSynmKESAV5VFJKvIkbCKpOO/8naBsJh9eqyk651dJ6xoB6VtcWYiuzYYQFeJtKQr+ZW6jPmZ+9ee+mXRhNyYHXM+C9YuaDbugDEeQGXifl7q3BaS6lHI5aEZg4ogZYGxSNCfL1PatG8wttta7i3DpdghBGaFJIgxmOQAj3rHxZelblq+2gFLxaJSYCVhWUQryOxms3ET1wyh1LJDjiYUoRunSeWQdTHSO9VklrxGpj7RO0jkFGxaL6TGYzudZgnOx2Wpw5jrbKTbvJIWCTmJnOTJMEaEjbLvArdUxZ3eZ1duhSUqGRRSASUmYMbgdQdD96i2uIPm0ot20tOl5CipuPA0nur00PqRVvwzCktNhayEttiEgCB9hsBvXXucT3QWn0A33A5Kp4YAcd55kk+G53WdFx8s0tTySrOnxTJEK0APrNUjG4aQ0tjVbi45JVJA3CgTqANjNeeIscykvPEuArIZaB+sg+GepA3k99BUakqaZW64c9y4QD5ExlbSOgG0UFMYW2tkAdb3O/P8A2rKILHEzexMZZREZKZxNrmBlxNsw+tqZzEZlSdImAoCNia8v4Q448i7uQl0oI0KyEjsmBCI9ulZbDC3CpCM8qjMoACRAEk7DTaT3FbnEmCXVwltlCgwylzOrcriNCY0MT+bbajCf2gwMpv8An5kpv7Np0vfSb+Wvl4BYBxCw4pdreMFCXFSnoUxsWztp5GpWxwp1pCUc9b7Rko2gpHQ9JHWexqq4xh7l42mzQsZmHz+MlBMaFJSNiZMGATt3qx8C2twyp6xvlBR2SmT4xAOZCjEEg+uh7VNjIYATF4jUEzlY2PnyyCpqODC4tbpNrgjeJsRbqNdVrXAHOhNsytJ3CQMwjfWBHsqav/DOLNqSGCv8RA0SrcpOqYJ+qBoT3BrlXBuF3CA8pp0wh1ZbSsalKVHczuY7b1Y8Oxq1vkIKlBpyfCoaQfIjVP6itPC8TgccRJB8vXI8vJZON4MVGDs2gEZxn4xpzvzXU6VTrXG37YAXCS81/C82MxH+MD9/2qx4ZiTVwjO0sKT5dPIjpXstcHCQvn3NLTBW9SlK6uJSlKIlKUoiUpSiJSla18pYbUWwCuPDm2nz8qIsy1AAk6Ab1zjiZSroKSlOZbw/CSfyiQnfvJUT2I7V8cvLjnFlx5xecEr0GRSRrCI1TO0yZB6V8xq4R+BiCTBQsiAJ2BCoA8ia8vi+JZUZgabHPoD/AKXs8BwdWnVD3C8d3qRI8M1zniC+FpZt2MjmBSuYrWAVKJ7agTvFaPAOC8xSXbgyw2qWwSfEQoE5epA7RqT5GrP8R+HWFuC4W4Q2pIVlQNTOv1HQfY1scH37r1s8lljlsIbCEPL1CdVFQBPiUZWTp16iqBVHZGLme8dPD5lMr0S3E9rphsWEwSTnI5H7AdcGLXCHsTbUlpTrDa8yjEJBAJTmJ0EHKYr1xNZMPZTcLkSTlQYj/Ed49IqKxLiVu1tflOZnWkqVnAjNmVOupMgQKhnuFr99pt0rQEuJC0pKjmynUEiIEgzv1FUtpkw8uwtGRvcm8j2n8za59NstLcTojDInCLCdpzI9lY8VU78uLRLKyltI5DwIhSDCgNYIKTsesUw7E3w2kXSFNu7JUYhz0I0nbSvfFj166GuW0PAgJ8KkjbQbkdqgMafurxDVlyVocZ/EJUQAExqqdssnf2qIYK8AxG8yRzN8vfZTLxQAMknbQzJgGIn7Sc1tYgv5J5d6wj8N1IQ6B/AokKlPkSPY+ojdu/idzGENBBITuZ1IM6a7f78qgLO2uS6mzdRK3xlSc3hUncqkaQAJ7iK3+Jfh8LVspacWtYjmZgPEBupuNY6wZnvWgNpgDtjc2BBsRz8Vie92OKLRF3EEd5p/mfPlCv2DttLas3lMoKlolWYA/UZEEjwiI2jaqhZPvn/mi1nQkK5KP41akByD0iY6mpfH8TaRYPKbWlSQyltgjrOVOnokkx5VXeGXbttpCrpl3k8sBlzLoAB4c0apTEQTArO1jjTdVbuRB2yMfMpOava4CoKb9b+MyJ2z9IWjw9xsG7l3moUUugJ3+ghROvlrr6Va8V4ru1WfMaQ4ECBKk6hJ/iOs5BO+u/bWq9x7ZWq7QXKFJFyFgKCSIWgiNe6gY26T20nfhpjXzLQac1UAGVa/UkiB66aVN7aRY3iGttYESf4n7eKpD6jar6NSCR3gY+05W9Lg2lWjgq/QLaWUysAQAJjoVT69a53xHiGIN4iHFgZnU5WlD6QnWCOukzrVs4H5vLFg2nKtl11D7gAkiYyjqRAknfYDrUf8QcUU3fMlLC/l2E8sOlBCMy9TCoyzCe/ftU2Ug0ljRjgH8+lpOsjmpOc01A4nCXEa6ZRtDrwM4vsrDcXHyGFvO6lakZEb7qME/rJNQSLlgYWUIgPLAS0kfm7jqIOs1tYzxKHL23YKVItUt5SSNFqIGaCRB00+9eGMJtU4g4tAytctKvCgBKIkEDKAkfTP+bWqO7AvfMc5t4X62VzA6SXA3JJjMYchleRFt1v8O4XcNtJQ6+SXB1OhPlMa1bWHRbupcUnIMoS6fzDQBSh3BjXsTOwqpWc4k5mKTyG55epGn5jB+1YuG8eeRdOsFJdtkqKUqVqCPX9KsoVOydj01/EeOmV81VxdA12lpjEBMR5X3jfM63XYgZ1r1UXgV8l1oQgoKPCpB3TAEbbiIIPUVKV9AvlkpSlESlKURKUpRErSxW7S00pSjGkD1OgA85rdqK4gYK2VZYzJ1TO0wR94JqLyQCQJUmgFwBMdVVMSbeS5nSuWUtmVQMx0AiR1n9KhcXv0sYWhLYKluk5ANVGVHbqSVED2r5e3jzFgsODxuuKQhEz+QD7qP6CpW7ZZYLa16/LNhpsRsoDxr9dSB6nyr50xEuyOfjcjygDryv8AVNGDC0CYNo1w2E/9nXPJUzHsJdRhyBek84N6BKh4RJyhXcpTE/7NQuE8R3Djdth7bOUuJCUE/Soa+KRvsSfOasdk4nEblxT8/KtCdzDi48KZ7DQn271GcFW7IxgCEoQhtcBA0BVlRI7GFb+VW0xSdLXj/lEwB16zPRcqGqxgLYJbAJibn/HpBk7lV3HuBnW0B964aOYTCT5xuYk6belTNxxQ/cpeuWUoDbGVJSpYCjOgCE9QAOlbnEhtUuKSpvMAo5c2sa/aqTiGIspUeW22AdICRXaDzxAHaMJiY0HoUqURQJqU3YZzJkk+cx/Ctzj+IcptxTCRmEpSVeKDsYivl23fMAXXKPMDZ+YSerfQRMgJA6dda3MOevbi2ZuS7A0S3zAFFRRopWhHhBECeoNYXm3FrWu7vlHP9SEeHMDpBMlURpFVlwovc2G58zbbrzVrQa1JrpPpn023z6Zo8G79gFtcAQUEDxNr7afY+VbPDeLuPrTaXHhuGgQFE/8AUT3Hc6VB4u/bWiWriyIC+YUrakkLRBhR13B0n+aseKPJum03DHgfb1gHxI/uCKCmC3/gcp0Ox5ZT55yhqHFH94z2NsxPp5ExceOOuHF5FPszlBl1sbA/nSNo7/fvVpwbjh15hstWquWhHLIBEGAJyyZOw6V4/wDGaHW0KfSGXW0BK0RlmOoHUGqceLeUopt83y8lSARBQVEkgRuAdjXQ2tVpmkBOE2NxI256Re41VRZSbVFV8AOFwbwRlzGs2sdirA4MOvyQpoNubHKMrgV3Pf3FaKOGv+G3bZN3lbcRzGyBJMKgpV0kaH3G1brCrbElJlYYuMsIeGniG2fuD/uKhsBTznnPnCp5bS+TkP0AKzAmZmfCYgdj0qTWubTeCThi4MEjpIj7Lj2t7amQ0YpsRkRB1z3tfnqrUp15u4fvrNaFNmC42kqzIGUBSgSSVHqfWp3DV2ptUuXNw4pCJUlCzIB1Ox8IJKjrE1RuIsHRa3wt7ZxwtLbStSMxJ1mU6akeGde9Wm7tiuzdlabVKW1paWRq4pYGZKgdfGEgSNokb69dSBdd3paOYEC0dMszC7i/TxNB01v0BIJM3jUXFtYPEuKWsQc+SQlLdsDmUv8AiWUkEAEfTP8AeugFxm2tQtATGUk6aJA/Npp0Hqa5bwzwwllbVy+VcorTmQkEGFEicw2EwPffvdbjFm7B51u5yvsKRzGCoDItMHKNRopJJBjXau1WAPEE4ddxOoHyMwFEMcacEd65jQxpPKZub/atcBv3b9tcNWzmRSyYnYJJ2SB2nQ9O1T2AXKrVlaXmsjiSBtIVJ1PmI1n71WsBwtCbZ24YeUhxKS4G5kRJOXaTppNXLgPij5lGQqClhKgk9U6emsgbVF4YXEtsMUSNOXzPxV4xMpw4SYEiYyi86je1ha9lcuGV5nMw8Mo1AMpUJ0I7EEke9WyuZcGYrDxbII5a8p9FQP8A2n2rpterwTsVIA5iR89l879RpdnxBEWMFKUpWpYUpSlESlKURKr+OrQ6Q2HRCDmWhKtSRGXNH8IOp9qnzXMlW2W9UoAIaZGZZjxOKOwKonUyTr0A2NZuJrdm3rb0lauE4c1nHYCfWI6mVG8Y4qG7yyDyYQlYMdFHWD/6iD7VXOK7m75oJISzcKH1n8+gX3TOlXG4bt3yLp5QJWsMpJ1yElIUY6EDQf4jVb+KNon5kB0r5WmVDeuaAABPTRMQBXhsguaTcT1zk5bwAvp2W7gs7D0uIJ/+iZPLmFsPONWnItCVKaCwlak+clRPaT9gfKtCwwJhb14/bu8tlCUpWjMStUzsSdtEnqZAgjWZocT2xbQ3d2pb8EQUxB3nTue8dqjruytVFw2r2TPukkE7deulBIaXTnPjfXS2lzeOS6GYsLS0iCOY6jmdyBA1KgrrDLa4/CbcdcfMhAC5UoxOs6kaHc9KsXDHDVgUG3ct0Lu02+cqJ0Kgo6JHWBEkis/GDgw92zdZSAw2UkZdyIhRJ6kgk+c1EcevKtL1q+aMjRfh2KFakdtj+1aKb6jQWA2Mj8RtPuFnrMpVofkcOIeBuDvEfcKH+ZcXiDFklSksZsuQQnKBJUEnpoDHrU/xZhVg04W8ogQJzKnYTrMmJ/StLEcKTiTnzduossp8SniIOYbhsGCpXQxoKqXF1o2FNJZeeddUYIWZJ7HQaelRFNr3MpglpvMSDIm568111U0w+t+5toEgi8WzvGgAvKtr3w+t1NIdbcWhLh0JIUBp1B8Ue9QPEQu8Oet0uFC20oJbUAAHEKVKgo7kg9CTGkVKpF7ZW5zBNy0gBS4MFuY/9QBMbVGsYycSu052wlDTcITM6yJJPc/0FSpvqDE5/epiZv8A6Pn1CqqtZiYxhwPJyjLXS1hMxnlqpl5JxRhtDrPISleYOmM5EEZUjsZBk9uvSr8acKGxU0Q6HG3klSCNxESFD1O/XWrHifEbFskpT43OiQf37VSrnFlXlw0H15USEyNkJJ1ip8D20zEUwMvW03KhxwoNcADNQkA89PBRrC1ZpSrKe4MftXTeDOHEBbDiXMynHEpWAQRqFEyd9IIn+YTE18424Ew+3sXLhhxYWnKEhSgQolQBA07H9KneFbJu2Ydc0C2WlKCSSSVhKv1mAYgeGreIrMe1uE5mPT54qHBhzcRcLi/STt7+agsRvIxp9fJW8htSR+GkkDKlMpOUdDKT71qsYrdYhdOXXIJt0ZkkRIaTl1yj83WRqPYVJ/CLFMxQIGfOorJOqiSTJ+/6VvfCxS2lvpBhKH16dtSD+1Z6lbs3PEXBjwjMc/m83NDixrgZ7uLaZOR8uqs9g7a39tyOZKtPqVOaDoAd0iO228GKo/GbaXbNdmpKl3FuuWVRqpOmdOw8QA22JmJ0qF4ZxQLxJx1s5ULcJgxlkq/lywP11966eeFrRKRzbkuRt4yoidYBJka0BNFwxf2wZNvAz008efXtY5hEnC+bXMEEgxAyI3ixIC5L8OsXSy+M6sp6AiZNXzBcPVaYgX22s1s4OYSBCUFZKSCegmSDtqBVK4uUk4k2y2kQ2dFQc5CspAXO8DUR0Vua6njKSxZsvZtUJBUkn6kKUAdt4OQx5VKtZ+If3CY5g2It0zUqLgWNab3LJOoLbzsbxMwDey2P+IIW6qEQ2RkzJGk7SD361d8LeUppJX9Q0V5kaSPI7+9cutHS2OQFHkuJztn06eqTp6RXUMIdSplCkqCgUzmGx71d9Ne52Kcres+y876tSYzARn7D3mQQt6lKV6q8dKUpREpSlEXlSoBJ2FULGrlK233SkNJVBRP1LGozHsD08h51bsbdKWVQYnSewO59hNUtbqbkrU4ByFS3M6jLqSP29a876hUGDs9T6c16f0ykS/tTMNiY11jna4/MLiVtxAq3uioytguBSkToYOhHmK6xiLDtxc2z6AFONQ643ljJ6kmJGhHn6VzTF08t9tMBbLDmYJgAkZsxBO6vea7JhLCsqchhTpC3CdIRpCT7EmO5NYaxacDmDT+B4x1t0XsvDmPfjOcxOUG7v+vlfrCjcVxZletyxl1hSikpzQNtspmqxxpa4eGi80JIT4Y6dhI6D0qycaqZccyL1bAAAJ02HbzqvYphFjyiUMjNoRlSNTA6ARlkbbbzvVDKrJOInPQC/iCFbTa7A0tbYjKTA2tB9Ihbls2bzA2eeFJU3mSCoEZkzAUJ3Gg/XtVeOIousOyLUA4x4FSdwPpPuP1Bq44Phlxe2yDdOpYYKSMqBlJE+EgfSkESduvSo3GMLw9hlbLDYSFJIUtZlSiQYJJ7HWruILGucQdQRr19LeCo4VxcAzMjFOw5TlnJ+WraMZunLO1ZaZ5bYCWeYqA3qqMw1kgkyTFeLuxZw9ajm5r8QVq6d8v5R/Sq2rFn7hhFrnBCIaQJAnWE/wDzVixTgW5Ii4fClpAmNREfm/i9atc0UzFR2EEmYkkjST/rRcpvxBoY3FDZGQAOR8ecHyzsPDLdpcWgU6Vq5qlpchZGUAkBIAPaDrvNeMX4PwdhClpeebIToUq/ur9KqqsIt7NtSlvuZinRKFFMqjy3iaqdg0u4eSha1EHckk6D1rlGgSXvY8hk7Hyzj0Kqr1cLmCo2ah5iBfmC4eCl+H+H2nitxalFAV4E6BSxO57aVccXv7Fi15S7VClqGUQAFoSd1J00UNwT1FRL6PlWUloFTzkhtI1gdVH0quXHDV2AXnklIgqKl9f71NhNar2rqkAZbnT4dTlCVGNoUuxp05JzIsB469JygnnZeDeCkYgkqXcOIAUrJmIOUaRMiCTO4gSDWDjfA3rBASLtLqF+GEkzA79D96huH8eukpDLJCUzqqNR/SprjXA2xaN3QunFuFWUtua79UkCB5ipy9vECnUiCTGvToVVLTwzqtKcgDbM6km8xflaFIfCGec2oCTnn7Ef2qbwFzljE1giAbgjy+v+9Q/woaMIV2JMeh1/aoheKfgXwzAZ3FgjqZWTHeslVpfXeB/l7ha6ZAoMnMsH5X34d8GXN04lxKi2k6yBqR310A866fiHA8IUBer5mUgZ4KQT10AMjuDVV+Ht9dos18lKVKSmNTBCdJJH8WUGYB1g1uNMkqSpy6ccWTrsB9gNpqHE1yahc4CQSB0G1vOTnku8Pw72tDabi1sA7mSJM3t0FlQeHrdacQUHhLgcIVHVUmSPInX3q9/Fa9bX8u2tTjYywkNnqI+sbET9oqcscPzc1VugruEJBbMgE+ISJVpsVdd4rUb4itL5JtbxoEgxOy21AxoR1G2h+9WmsKj+1cCBYSNxrrG97LjKXZtFNgDi2TBzh3K021BlbOB4c4bH8RebInM0oT9X5SP5hpO01b+BpKVqGiTEp6BXUjtI3HfXrVbwzDTbrLZeztpAUlXUomBPSQdDttNXzA2AlrT+JRJ26ny8qt+nhxqyNJB538LbLL9VqtNODeTLeVr/AM+ealKUpXtL59KUpREpSlEWveWyXEKQrZQgxv7VynGFhmzUhpUpaWvNJlROZWh030Nder8+/EviZpm5urcNmVGTGwUd59fq96xcbQNRndEm3WJuvT+l8Q2lV/UdDc+U7+VlLMcJNu2tvcqzZ5S44mdFJzBWUpj8vh9atd9i2RhbwWk55Aj+ECQR6yKpOJcSK5zDduUrQ4AnTYDQEgjsJoMDuVZmlXCPlXMyjp4m95y66knodNZ714ziXC5gc+sFe4aYJDqhkzfoRij0GWYtCg+HXxd4gXlp5iGNUt75lGf4esAE+1Ttvwflz3L5WnMolLEkECdQe0jt3HanAuAqZfXFuSy0C4HlAAuHKtKddynxfTqJBPlULx3xLdOKKGnIA0IH1ftWkkYwykcwI2A/P+utbS9+IvGRl0ZnOAL7eECZVix+4u/lW1W6U5csIBP8KdBHlpHtVY4ewxFw1cG/Ki/IDSCogARqpIH1dqlrpT1th9s5zEXCCkwUApgA7HNqSNthse0mtPY7buphUoUfzj9iNKraKgLwxuuYuR7wpjAabMbo5ZA3yO50+yjuJOH026Q43IAMhROpP+kfrU81xTdXAZtzkSpyEl0enbudveq5e2jy0BAeWtsagZpFfcJWFo5av+o2YSQdxuI8xFanND6QNQhxBPgDlb7g2WQQyuRTGEGNoJGfS2tjsrTxVwnbtWCnypfOCwAVEnNOh3qmcIj8fsYqTfxJRfQbpbjjCZgEyEmNFEdauBwu3um8zcNvZfwnUGPZQ2INViq6lS7OpfFkbkDl83sFI0RVr9s2xbmLAkXv62J2udBVsRxzkXpKwVJCQISQCnrAnTXrXziLiR3EClACkMJ2BOp/pHlVdatiLhSLklKgTmzHr5ntW9fYulIDbEHuqP2rR/TsY5uBsuAz06rM3iXVGuNR0Nk2/u6b9YvzWwl9DEIbTncP8I/c1ZME4dau2y3cPKS8QSgj6EnoI2jSNfv2qmCX7aAQ54Sf44kqGtTeAYgX7gNNy2gCf5l+s6VRxAeyS2bXJ+ach42Wyg+m8Q452A26/nL/AB54uE3bttblvbhJCVKTzSDAOokRvPT1rT4r4ZRZJAWr8Q9Os10y2ZZtxymmwXsvhQDqe09p79agcVwNpIcusRdlyYCeg/lSNzFVUuK/UxRE7Zu69UqcKDSwmDAgE5AcuQy8iStP4fYz9IA1T9Qnf29Kxcc2lzaLLjTy+Q5q3t4DuUHyGseXpVXsbp43PMtmF5ZgJAnTz6TXRcWuUv2jlu8cjgAyoUIWF9JB1A19wfOu1GijXxYQQ6JFjHVdD3V6MgkFtpuMQ0I39k+F2NLyrBXK1gpC1HUEjTy3Ee9Vjiiyat7lksuKLrmZbyVR4Dm0276/avvAFu6zcZHUlBGuVWkSJB16eddFvOE7Rxa7zL18UnRSvIHp1ruIUqz2C4zjqpCHNp1HWJwz1Fo8R8zWli7KmrL5poqUYAeBIJSCQAU+XcVfOBrlTjZVzCpBAISd0HsD2PbpVZRcNqQ4HG/rTkQlIhPYaDqavfDeGfL26G4GaJVH5jv9tvarPp7SH93LX26b9Fm+rOBow/PF3ekX6gZeQUtSlK9lfOpSlKIlKUoiV+ev/qFw9tu7aeSIW6jx9jl0CvWIHsK/Qtcz+OWAl+x5yEgrYOugJyKiY7QY/WuFTZcwuRnGVON2KWU5HGylCTHhJJAJJHQnf1rpP/hJ24hBug2hBMrTuYmSNYAkkSa4S3iDiIyrIjby/wDiu2fDlS7q05rlwUSpcjyATI9zr715HGUOzioBIvmdT7Zr3+G48PaWh2ExGXI3tr+VYU42HEcoKCDlDcxAOUCI7jTbzrnnE+FLaUpXKLg3K0f2NWfFeDyttb6brK2g6ZfqnyOw3FUnh3jC4Q9yXAHkyAkEwtUqSkBM6KMnY9J10rFRp1Hd4XIF76fb5qtbqlGkCGWaTGWvt4rMxxA2qyWwNCkkhDnhInUx3E6+9e8C4RCm1v3qMpUj8Fo9JP1K26bCpm8sLd3EUNOISnlAurTH1FBAjsdTMeVRPF+OvPv8lr617fyjvU2OMRTsXXk6BSc2/wCpcDbUnIc/OLzAMKuYBhLAvVtPurSyAdUHdWyUn71qYphPKuVIt1zpmHcVLXqUWrOUeJZO53J6k1HW74YSpxZlxf1Trp2H6fatratRxxg2yA3O6xOoUmjCRF8Rv+0Xt866X2Ld5LvgeyoX3OgV99jXhnFEWrymW1FxrQjKZyq6x3FeMCtUXzrinlhJQkZWxpmE66+X9alL5uzYICMgKfzan1NQeWNcabgSY/aMgeuaspl9RoqtIABs45kagjK/XmRKgOIHV3T5cCCkQEydzHU+Z/tWFTbbI8WpI6HU+tSDNw5dOJt7ZMrWTqTA0BJMnsBNTtlwq23qtXNc6k7DvHlPWrH1xRYGvtsBn4qplAVarnUrnVxyHIAZnpbmqth9o4uFtsOLKNfCklOmtWLHMVSq3buGVkOJMKg6gHeJ21qwYTxAbZDj1ugvcoHNkgIGhmSTt6TUFw5wou7ZdUXOWpwFY2ynQkAiJ1PbyrMawf8AqVBABjqDmDrlfLbNaOydTDmMM92Zyvofh+15DgPFf4IUpalarUd56kkyT/YVkbIfeuPnVollxSMubwJyyARO/eTqZ9qolliT7LqWwrKpKspEAwQYNdIa4UYvG1LczIdzSXB1mZJ7nrFR4ik2k+XGA7Ii/wCLEbZdF2hU7VmID9tjO9oynJa9txDbsk8rxxr4RpA8zH6TULglw/ieIreS2PEcxGbYJAAk9dE1F29qptbjCozJmTMAjyn9qtXw7S2yhalEpCcxUfyhPQnv6VI06dGm5zbkwPA+mXJO0qVaoJthBOWugPKVocfW1yHzcZMoaCETmAUrfVPVe8GJjSrgu/d+QSp+W0IGdST2gGR3mdqjbVDl+tt+50aQZQgbR69z19qrnxC4vFwflbc/hJhKjJ1g6JST/CO/X95MYKuFjRcWPz5dHuPDtLnEGTIHONOe+wUx8OL26xDFGnAk/LskqWP4UDKrJPdRUBA8idhp+hKoXwa4e+Uw9JMZ31F1R8jAQB5ZQD/mNX2vYYxrBDQvm69V9R5LzJ+e6UpSpqlKUpREpSlESsF1bJcQptYlK0lKh3BEGs9KIvyXx1gSra8WzlA8UAxoZ2PuCDUZa8Q3DTfJQuESVDuJ3g7613D434BmbReI0UghKyOmsoV7K0/zCuF4wEqIWEhOYCYGx66etQdTa8Q4SFvbUeG9rTMHl6/Oavz/AB7bpsmW285cyJD4VIzKAgqmSJJ196irZlLq0XNqZUhQUEkagg9R+kiqnidiUOEAQg6pJOhT0IImZrf4SxdFq+2+4krSg6I6EbKBB0Igkx3FYn8E1uJ1PO/jyW1nHPDuzqgR77ySfkCys99cB0qccUWX0SpQOix/hO59K1+FsbaaL/zOYOrMpdUknQD6TGo77R9hW0LZjE7t1bC+U2EgrKknSdAEpB8u/atly9bB+XuynWEpfyxrp9XY6b7aa1hLWhuAgydNW+l+h0vC9EVDUPaAiBr/AGnrcC2VstwqutJfdU6qeUkkIq1r+G6i2y+64FKdGZLOaIB2CldDqNdprQ4jwJxpKxakpQoyUADXz8vatTh3id1QTa3AUQgZEOAEqRvCVR0gb9I+1mN76eOgcrRqBr58vBUva1lUMrj90kkiQToOUeyil4Q5cXJYt2C2tB8YJ/6Y2JUe3pv0q38QcIWzaAlCFapEOK1UVRqT7618sn1WL7q1klt5IS4oCSIMpPcj0q1u3zF1a5cyVpjRfY9PsehqqrxDiW4SQ0a3z5/yus4bCXYgCTpy0P5MriZbXavgZspBkKHTzq347bX1w0ChYKCnMQgZcw7k9fT9K2bPhNNyTzSYBMZeh29em1SGO8MXdrbpFo8p9giFDL+K0DEgQdRV9SsKj2lsYxuLdfBU0aPZscx84XZQTPT8X6ysPBuMsOW67ZIyBaMjiPXrO+9Rt7idxhx5U52j9ChEjyPpWbi+/s27S3atAkXCVSVJTC9iDnPmenvVcXdXV6UNKCd/Sq6dEO75HcJJIdmOe/wgq51cgYB/5Bq0CD10Gn3CjrRr5m4JWrJnXJPaetXnGXk2pbQb5+FIBgx5g6xtpuTVTt7ctXS24y5VajePLv13OtbnxDWVLZ/la191GP2rTUpirVaw/tjl+FRTLqPDPqgS/FfO94OviozF7xrN+EVdZOYkmfM0w/EGyA04MiOqhqdPKtDC7oNKKlNhYIIAVtOmvtWEpzr2iewraKLYAN1539VULsbYk6Rp82hWa/4udLPy7MtonVQJzKHl+UH/AGa+cMcPG4vLe3SZKykrI/hB1P2SCa0Lu3TzGmk9EDMYjz1jsIrrvwKwTMt6+UNPob94k+yQB/mNSpUmUxDQrK1RxxVHmSMvnXzXYWWglISkQlIAAHQDQCstKVYvLSlKURKUpREpSlESlKURaWLYei4ZcZcEocSUn36+o39q/K3EmDOMOusLHiQo/cbx5EQoV+tq4/8AHDh+OXfNp7Idj/sP2lJ/y0Wjh3gHCciuJOLK2QDqUeE+m6f7e1eGLcONaGFI0I6EEkg+u49hW00yEulJByLGn7j9dPesNgAl7LMBYKffp+o/WuK8tuMX/qfY/ZeMJvnWHZaUUkgpMAajtr6CtS4uluGVrKj5msl2Chcg6gyDUljKcyeZGqgDPr0/pXMLZxRdV4XFrmYjAvGn3UrwxxkthotOoU41skg+JMaxrukdulTfB6rUXSr0lLqUpUSgkpKCepAMkASPeqXhCwttxlRIghxMDWQCkidwCFf9tRtyxkXln3rK/g24i5hwk58/BaqfFvbSaHjE3TQg5WI+dF1i+xIPPK5kcl4yhQiETt5ZT+n7VrGWvkVcxDgSsn/pbhY6kjp6/ao1i6dbhTCQppYnIoiEq/iAAIKYP3GtRGL3xeWXFJSkkxCdhGnrWenwLmPie7rz6+/5utnE8c00rDvacuYOoj+dlf8Ah7HWX1AoVy3Y1Qo6K9IjNHsatmFYyoQnKQraJ0PoZ/euHLtHEDOQQNCDP2iKtOAcbPNwhSEOKiErUSI/xR9X6GucRwBzp+qhw31AHuVxHhY+Gn26L7xliaP+IPqDYUBAVGkKA1IjTyPpUe3xUpBBZaSlXc6/atfFbVwh24eWCta9k9z4ifQDQDz8qx8O2aXFgqnwkbGPf2rW3hWYQHiYG5WX+o4jtMLTEydLCbdF7uMSdRcLcIBcVBVnHUwe+n9qwvF59TjjknSSYgAAbDpsNBWtiL3MeUv8ytPTp+kVKX7mS2I/OQn7an9hV7WNmQFX2jnB2InCCTGny60MDZSpYzJza7VtNkO3C1xCcxPokf6CmFjI0tyPpGnqdB+/6ViaGRknqrwj061NSptwtaPE+y2rRsrUpQkqcVlQI7/6aV+puEsHFpaMsDdKRm81HVX6/tXE/g3w8X7xDihLdsM57Zz9I++v+Wv0NXVRxLsmeJSlKVxZEpSlESlKURKUpREpSlEStDGcNRcsOMOfS4kpPl2I8wYI9K36URfk3ibDXGFKaUIcZUQfvuPLr71BX6DIWOviFd2+MvC6lReNCfDleH/4q+2nsmuJrZPLIjVCv0NdXpyKjJ+SFgxBGZIWBuK27UZ7aOqSU/fUf1rHbO5mchE5P2P+teMFMlbfcSPb/Sa5quiMYO4ha2CGHgD1kfof619xlEO/asKwUPeipqR4kt8pFFnDf0nN2Ky4Lq2ROy/3FQbg3HZVTvDpBDg9DURfDxuD+aminVE0x4j7qSxFP/LIPeP2qPsh+Kn2qRvkf8sjXTStTCkS8ihzC68d8eCkOIBDKP5lKP2CR/WvOCJyMuOa6AkH2gV94sP/AEh5E/c/6UJy2YH5iP3mmqnH6xOwUVaty6NOtSHEBMtNdk5j6qP9gKx4OgFz3r7erDt0ojaYHoNP6VzRRDf043Pz7LJfSGm2/wAxzfbQf1pu4lPRCdfWjxCniRsgR9v9avfwd4RVdXHzLqfwGlZiTstY1SkdwD4j7DrUlY9wbLjl+P5XW/htw/8AJ2SEqEOufiOd5Ow9hA9Zq20pXF5bnFxkpSlKLiUpSiJSlKIlKUoiUpSiJSlKIsFywlxCkLSFJUIIPUGuAfEHgVyxWXW5Wwoxm6gHYK8x36/oP0NWC7tkOIU24kKQoQpJEgiugq2lVNMr8h4eyeapPdJHr1rFaeB5J21j76V1rj/4XutK+ZsElxKdVNbrA/l/OPLf1rlWKWpQoL11MwdweoPpXFva5rmy3QytXF0fiE1JYqM7KVb+EffrWDFlgqJI3E1maVNukdpH612LruEYnDda/Dp8ah3TWjiLcLX61vYOAHt40NecXbBcJHXeoxZRLP04Xq8E2yPKsOCj8UelbL6fwQnymseCJ8ZJ6Cu6hdjvhZeJRLqR2SB+9esTTDKB0n+leMZ1fJ9K84guUJ9a7upuiXFesJhKVL7A1r4SQFKX2BNSeGYQ8+3y2G1OOLMBCRJ9T0A8zAFdf+H/AMJG2AHb3K64deUNW0/4p+s+X0/4tDTZVVKgp4Z2VO+Gvw5dvBz3wWrdWs7LdHZHZJ/P9p3HfcOsm2G0tNICG0CEpSNAP99etbQFfa4sNSq5+aUpSirSlKURKUpREpSlESlKURKUpREpSlESlKURKq/FfA1nfg85vK50db0WPXSFf5gatFKLoJBkLgPFPwhvG0zbqTchO0QhceYUcp9la9qoTtk9bpLb7S2lTOVxJSfaRrX67rDcMJWkpWlKkncKAIPsaLQ3iXAy4Svx5aujmzXq+dk1+nL74dYW7qqyaSf/ALct/wD6ymop34P4Uf8AynE+jqv6k12VYOKEZL8+BYKTJ6Vjw1wJJJr9FNfCHChuy4r1dX//ACRU1hfA+HW8cqyZBGylJzqH+Zcn9aSh4pucL86tcPXd67NrbOOA/wAQEI91mEj3NdE4f+DClhJvnglI15TOpP8AiWRA9AD612gCK+1yVU/iXOmLKMwTBLe0b5Vu0ltPWNz5qJ1UfMk1J0pRZyZzSlKURKUpREpSlESlKURKUpREpSlESlKURKUpREpSlESlKURKUpREpSlESlKURKUpREpSlESlKURKUpREpSlESlKURKUpRF//2Q==",
        mining_type: MiningType.all.sample
      }
    ]

    coins.each do |coin|
      Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-02-08 01:57:56.834888"], ["updated_at", "2023-02-08 01:57:56.834888"]]
---
  task add_minings_types: :environment do

    minings = [
      {  description: "Proof of Work",
         acronym: "PoW",
      },
      {  description: "Proof of Stake",
         acronym: "PoS",
      },
      {  description: "Proof of Capacity",
         acronym: "PoC",
      }
    ]

    minings.each do |mining|
      MiningType.find_or_create_by!(mining)